import pytest
import pandas as pd


@pytest.fixture
def transactions_data():
    return [
        {
            "Дата операции": "30.12.2021 19:18:22",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*5091",
            "Статус": "OK",
            "Сумма операции": -7.07,
            "Валюта операции": "RUB",
            "Сумма платежа": -7.07,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Каршеринг",
            "MCC": 7512.0,
            "Описание": "Ситидрайв",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 7.07,
        },
        {
            "Дата операции": "30.12.2021 19:06:39",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -1.32,
            "Валюта операции": "RUB",
            "Сумма платежа": -1.32,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Каршеринг",
            "MCC": 7512.0,
            "Описание": "Ситидрайв",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 1.32,
        },
        {
            "Дата операции": "30.12.2021 17:50:30",
            "Дата платежа": "30.12.2021",
            "Номер карты": "*4556",
            "Статус": "OK",
            "Сумма операции": 5046.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 5046.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Пополнения",
            "MCC": "",
            "Описание": "Пополнение через Газпромбанк",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 5046.0,
        },
    ]


@pytest.fixture
def bad_transactions_data():
    return [
        {
            "Дата операции": "30.12.2021 19:18:22",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*5091",
            "Статус": "OK",
            "Сумма операции": -7.07,
            "Валюта операции": "RUB",
            "Сумма платежа": -7.07,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "Категория": "Каршеринг",
            "MCC": 7512.0,
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 7.07,
        },
        {
            "Дата операции": "30.12.2021 19:06:39",
            "Дата платежа": "31.12.2021",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -1.32,
            "Валюта операции": "RUB",
            "Сумма платежа": -1.32,
            "Валюта платежа": "RUB",
            "Кэшбэк": "",
            "MCC": 7512.0,
            "Описание": "Ситидрайв",
            "Бонусы (включая кэшбэк)": 0.0,
            "Округление на инвесткопилку": 0.0,
            "Сумма операции с округлением": 1.32,
        },
    ]


@pytest.fixture
def mock_df_transactions() -> pd.DataFrame:
    data = [
        {
            "Дата операции": "31.12.2021 16:44:00",
            "Категория": "Супермаркеты",
            "Сумма операции": -160.89,
        },
        {
            "Дата операции": "30.12.2021 12:00:00",
            "Категория": "Каршеринг",
            "Сумма операции": -500.00,
        },
        {
            "Дата операции": "01.05.2021 10:00:00",
            "Категория": "Супермаркеты",
            "Сумма операции": -1000.00,
        },
    ]
    return pd.DataFrame(data)
